
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖

<details><summary>Show Plan</summary>

```
tofu
data.aws_secretsmanager_secret_version.creds: Reading...
module.qdrant.aws_cloudwatch_log_group.qdrant: Refreshing state... [id=/ecs/mediamind-qdrant]
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Reading...
module.ecs.aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac]
module.ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/f9e9016768a01582]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/693431dca2c06509]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
module.ecs.aws_lb_target_group.ecs: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747]
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.qdrant.aws_efs_file_system.qdrant: Refreshing state... [id=fs-04611310d7d2b8293]
module.s3.aws_s3_bucket.backend: Refreshing state... [id=eutop-mediamind]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service]
data.aws_secretsmanager_secret_version.creds: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/app-env-fUauFQ|AWSCURRENT]
module.redis.aws_elasticache_cluster.redis: Refreshing state... [id=mediamind-redis]
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=ecr-mediamind]
data.aws_vpc.selected: Reading...
module.qdrant.aws_iam_role.qdrant_task_execution_role: Refreshing state... [id=mediamind-qdrant-task-execution]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-ecs-task-execution]
module.database.aws_db_instance.postgres: Refreshing state... [id=db-JTOTX5CRVLOAA47F5LJFTYSYJA]
module.qdrant.aws_iam_role_policy_attachment.qdrant_task_execution_role_policy: Refreshing state... [id=mediamind-qdrant-task-execution-20250529181739908900000001]
module.qdrant.aws_ecs_task_definition.qdrant: Refreshing state... [id=mediamind-qdrant]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-ecs-task-execution-20250529150109931500000002]
module.ecs.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-ecs-task-execution:mediamind-service-secrets]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service]
data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
data.aws_subnets.selected: Reading...
module.ecs.data.aws_vpc.selected: Reading...
module.ecs_dev.data.aws_vpc.selected: Reading...
module.qdrant.aws_security_group.qdrant: Refreshing state... [id=sg-0f4f72368e2d52623]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0cd43e1101e5aa36f]
data.aws_subnets.selected: Read complete after 1s [id=eu-central-1]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0d990bb33ae872102"]: Refreshing state... [id=fsmt-0c39849845d78983d]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0910d308a8661b1da"]: Refreshing state... [id=fsmt-0e0a3662e8daddc56]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0f691c9f6c562fab6"]: Refreshing state... [id=fsmt-06b0ba38a3120241e]
module.qdrant.aws_ecs_service.qdrant: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-qdrant]
module.ecs.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs_dev.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

OpenTofu will perform the following actions:

  # module.alb.aws_lb.shared will be created
  + resource "aws_lb" "shared" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "mediamind-shared-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0910d308a8661b1da",
          + "subnet-0d990bb33ae872102",
          + "subnet-0f691c9f6c562fab6",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:eu-central-1:313193269185:certificate/ba1c0b9b-2c80-4c0f-acf6-355dfb9ba658"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not found"
              + status_code  = "404"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener_certificate.dev will be created
  + resource "aws_lb_listener_certificate" "dev" {
      + certificate_arn = "arn:aws:acm:eu-central-1:313193269185:certificate/3f5b9917-f56f-414a-ab56-b751c55733ee"
      + id              = (known after apply)
      + listener_arn    = (known after apply)
    }

  # module.alb.aws_lb_listener_rule.dev will be created
  + resource "aws_lb_listener_rule" "dev" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "dev.api.mediamind.csee.tech",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.prod will be created
  + resource "aws_lb_listener_rule" "prod" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "api.mediamind.csee.tech",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.dev will be created
  + resource "aws_lb_target_group" "dev" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "mediamind-dev-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-07a194586a2bb7a62"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/v1/healthcheck"
          + port                = "8000"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group.prod will be created
  + resource "aws_lb_target_group" "prod" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "mediamind-prod-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-07a194586a2bb7a62"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/v1/healthcheck"
          + port                = "8000"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP/HTTPS"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "mediamind-alb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07a194586a2bb7a62"
    }

  # module.ecs.aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service"
        name                               = "mediamind-service"
        tags                               = {}
        # (17 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "mediamind-service" -> null
          - container_port   = 8000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747" -> null
        }
      + load_balancer {
          + container_name   = "mediamind-service"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_lb.ecs_alb will be destroyed
  # (because aws_lb.ecs_alb is not in configuration)
  - resource "aws_lb" "ecs_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac" -> null
      - arn_suffix                                  = "app/mediamind-service-alb/622784b324fe8eac" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "mediamind-service-alb-1972183460.eu-central-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - enable_zonal_shift                          = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "mediamind-service-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0cd43e1101e5aa36f",
        ] -> null
      - subnets                                     = [
          - "subnet-0910d308a8661b1da",
          - "subnet-0d990bb33ae872102",
          - "subnet-0f691c9f6c562fab6",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-07a194586a2bb7a62" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z215JYRZR1TBD5" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0910d308a8661b1da" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0d990bb33ae872102" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0f691c9f6c562fab6" -> null
        }
    }

  # module.ecs.aws_lb_listener.http will be destroyed
  # (because aws_lb_listener.http is not in configuration)
  - resource "aws_lb_listener" "http" {
      - arn                                  = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/693431dca2c06509" -> null
      - id                                   = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/693431dca2c06509" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac" -> null
      - port                                 = 80 -> null
      - protocol                             = "HTTP" -> null
      - routing_http_response_server_enabled = true -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.ecs.aws_lb_listener.https will be destroyed
  # (because aws_lb_listener.https is not in configuration)
  - resource "aws_lb_listener" "https" {
      - arn                                  = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/f9e9016768a01582" -> null
      - certificate_arn                      = "arn:aws:acm:eu-central-1:313193269185:certificate/ba1c0b9b-2c80-4c0f-acf6-355dfb9ba658" -> null
      - id                                   = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/f9e9016768a01582" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac" -> null
      - port                                 = 443 -> null
      - protocol                             = "HTTPS" -> null
      - routing_http_response_server_enabled = true -> null
      - ssl_policy                           = "ELBSecurityPolicy-2016-08" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
        }
    }

  # module.ecs.aws_lb_target_group.ecs will be destroyed
  # (because aws_lb_target_group.ecs is not in configuration)
  - resource "aws_lb_target_group" "ecs" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747" -> null
      - arn_suffix                         = "targetgroup/mediamind-service-tg/cadbf7f41a821747" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "mediamind-service-tg" -> null
      - port                               = 8000 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-07a194586a2bb7a62" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/api/v1/healthcheck" -> null
          - port                = "8000" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.ecs.aws_security_group.ecs_service will be updated in-place
  ~ resource "aws_security_group" "ecs_service" {
        id                     = "sg-0cd43e1101e5aa36f"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8000
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
        name                   = "mediamind-service-sg-20250606141544430100000001"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.ecs_dev.aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/mediamind-service-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs_dev.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "mediamind-cluster"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # module.ecs_dev.aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "mediamind-service-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "mediamind-service-dev"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0910d308a8661b1da",
              + "subnet-0d990bb33ae872102",
              + "subnet-0f691c9f6c562fab6",
            ]
        }
    }

  # module.ecs_dev.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "AWS_REGION"
                          + value = "eu-central-1"
                        },
                      + {
                          + name  = "AWS_S3_BUCKET_NAME"
                          + value = "eutop-mediamind"
                        },
                      + {
                          + name  = "POSTGRES_SERVER"
                          + value = "terraform-20250609085354185200000001.cjs8q4moq2nh.eu-central-1.rds.amazonaws.com:5432"
                        },
                      + {
                          + name  = "REDIS_URL"
                          + value = "mediamind-redis.72tuoo.0001.euc1.cache.amazonaws.com"
                        },
                    ]
                  + essential        = true
                  + image            = "313193269185.dkr.ecr.eu-central-1.amazonaws.com/ecr-mediamind"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/mediamind-service-dev"
                          + awslogs-region        = "eu-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "mediamind-service-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "APP_CONFIG_JSON"
                          + valueFrom = "arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/dev-env-mjm2wi"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "mediamind-service-dev"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false
    }

  # module.ecs_dev.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mediamind-service-dev-ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_dev.aws_iam_role_policy.ecs_secrets will be created
  + resource "aws_iam_role_policy" "ecs_secrets" {
      + id          = (known after apply)
      + name        = "mediamind-service-dev-secrets"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/dev-env-mjm2wi"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_dev.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "mediamind-service-dev-ecs-task-execution"
    }

  # module.ecs_dev.aws_security_group.ecs_service will be created
  + resource "aws_security_group" "ecs_service" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to ECS service from ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "mediamind-service-dev-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07a194586a2bb7a62"
    }

Plan: 17 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>
